package ru.shirko.telegram.InformingKubSU.constans.bot;

public enum BotMessageEnum {
    //ответы на команды с клавиатруры
    START_MESSAGE("\uD83D\uDC4B Здравствуйте, я бот Информирования КубГУ.\n" +
            "С моей помощью вы сможете отправлять сообщения и файлы другим участникам в КубГУ. Начнем!\u203C\n\n"
            + "Для авторизации нажмите воспользуйтесь /login"),
    HELP_MESSAGE(
            "Данные о пользователе:\n\n" +
            "ФИО пользователя: %s\n" +
            "Текущая роль: %s\n" +
            "Группа(для студентов): %s\n" +
            "Если вышеприведенная информация является неверной, или вы хотите сменить роль," +
            " можете повторно пройти авторизацию с помощью /update"
    ),

    //авторизация пользователя
    LOGIN_START_MESSAGE("\u270FВведите ваше полное ФИО"),
    LOGIN_CHOOSE_ROLE_MESSAGE("Выбирете роль, под которой хотите авторизироваться\uD83D\uDC47"),
    LOGIN_INPUT_GROUP_MESSAGE(
            "\u270FВведите данные о себе: курс, группу, подгруппу(0 в случае её отсутствия)\n" +
            "В формате: <курс> <группа> <подгруппа>\n" +
            "через пробел без разделителей. Например: 3 3ИТ 0\n" +
            "3 - курс\n" +
            "3ИТ - группа\n" +
            "0 - подгрупа"
    ),
    LOGIN_INPUT_KUBSU_LOGIN_MESSAGE("Введите логин в информационной системе КубГУ\n" +
            "Или авторизуруйтесь под другой ролью /login"),
    LOGIN_WRONG_INPUT_KUBSU_LOGIN_MESSAGE(
            "Вы не можете быть авторизированы в качестве преподавателя, используя этот логин.\n" +
                    "Повторите попытку или смените роль"
    ),
    LOGIN_INPUT_KUBSU_PASS_MESSAGE("Введите пароль в информационной системе КубГУ\n"),
    LOGIN_INPUT_STUDENT_UNDER_GROUP("Введите вашу подгруппу(0 - в случае её отсутствия)"),
    LOGIN_ENTER_PASSWORD_MESSAGE("Введите пароль для подтвреждения роли"),
    LOGIN_TRUTH_PASSWORD_MESSAGE("Успех\u2705 Теперь вы авторизированы и можете пользоваться доступным функционалом"),
    LOGIN_WRONG_PASSWORD_MESSAGE("Неверный пароль\u274C. Попробуйте ещё раз или пройдите авторизация под другой ролью /login"),

    //Неизвестная комманда
    NON_COMMAND_MESSAGE("Я пока что не умею обрабатывать такие команды\u2716"),

    //Команды при отправке сообщений
    SEND_COMMAND_MESSAGE("Выбирете кому вы хотите отправить сообщение\uD83D\uDC47:"),
    SEND_COMMAND_INPUT_GROUP_MESSAGE(
            "\u25B6Укажите группу, которой хотите отправить сообщение\n" +
            "Формат: <группа> или <группа>/<подгруппа>\n" +
            "Например: 3ИТ или 3ИТ/2"
    ),
    SEND_COMMAND_INPUT_NAME_MEMBER_MESSAGE(
            "\u25B6Укажите сокращенное или полное ФИО человека, которому хотите отправить сообщение\n" +
            "Формат: <Имя> <Фамилия> <Отчество> или <И>.<О>.<Фамилия>\n" +
            "Например: Иванов Иван Иванович или И.И.Иванов\n" +
            "\u2757Обратите внимание, что при записи сокращенного ФИО не должно присутсвтовать никаких разделителей кроме точек\u2757"
    ),
    SEND_COMMAND_INPUT_TEXT_MESSAGE(
            "\u270FВведите сообщение, которое хотите отправить\n" +
            "Сообщение также может содержать файл, просто добавьте его!\n" +
            "\u2757Обратите внимание, что при отправке фотографий/картинок необходимо убрать галочку <Сжатие файла>\u2757"
    ),
    SEND_COMMAND_CHOOSE_CATEGORY_STUDENT_ALL("Выберите категорию\uD83D\uDC47\n"),
    SEND_COMMAND_INPUT_COURSE("\u270FВведите номер курса, студенты которого должны получить сообщение\n"),
    SEND_SUCCESS_MESSAGE("Сообщение успешно отправлено\u2705"),

    //ошибки
    EXCEPTION_NOT_FOUND_MEMBER("\u274CУчастник с таким ФИО не найден!\u274C"),
    EXCEPTION_ILLEGAL_MESSAGE("Нет, к такому меня не готовили! Я работаю или с текстом, или с файлом"),
    EXCEPTION_WHAT_THE_HELL("Что-то пошло не так. Обратитесь к программисту");

    private final String message;

    BotMessageEnum(String message) { this.message = message; }

    public String getMessage() { return message; }
}
